Can't create one or more Rails with desired offset
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotOffsetRail { get; }
  Visual Basic
Public Shared ReadOnly Property CannotOffsetRail As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotOffsetRail {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace